Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo.IsModified Field
 Whether the object's has changed in a way that affects its numbering. This can include some UDA change.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly bool IsModified
Public ReadOnly IsModified As Boolean
Field Value
Type: Boolean
true if the object is new or its property has changed; otherwise, false.
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace